/**
 * 03. Special Sort
 *
 * ▣ 문제
 * N개의 정수가 입력되면 당신은 이 중 음의 정수는 앞쪽에 양의 정수는 뒷쪽에 나오도록
 * 정렬해야 합니다. 또한 같은 부호끼리는 입력된 순서를 유지해야 합니다.
 *
 * ▣ 입력설명
 * 첫 번째 줄에 정수의 개수 N(1<=N<=100)이 주어집니다.
 * 두 번째 줄에 N개의 정수가 공백을 사이에 두고 입력됩니다. 0은 입력되지 않습니다.
 *
 * ▣ 출력설명
 * 음의 정수는 앞쪽에, 양의 정수는 뒷쪽에 나오도록 정렬하여 출력합니다.
 * 같은 부호끼리의 순서는 입력된 순서를 유지합니다.
 *
 * ▣ 입력예제 1
 * 8
 * 1 2 3 -3 -2 5 6 -6
 *
 * ▣ 출력예제 1
 * -3 -2 -6 1 2 3 5 6
 */

function solution(arr) {
	// 여기에 풀이를 작성하세요
}

console.log(solution([1, 2, 3, -3, -2, 5, 6, -6]));
