/**
 * 09. 결혼식
 *
 * ▣ 문제
 * 현수는 다음 달에 결혼을 합니다. 현수는 결혼식 피로연을 장소를 빌려 , 하려고 합니다.
 * 피로연에 참석하는 각 인원의 도착시간과 떠나는 시간이 주어지면 피로연 장소에 동시에
 * 존재하는 최대 인원수를 구하는 프로그램을 작성하세요.
 * 만약 도착시간이 13이고 떠나는 시간이 15라면 13시부터 15시 전까지 피로연 장소에
 * 존재하는 것으로 봅니다.
 *
 * ▣ 입력설명
 * 첫 번째 줄에 피로연에 참석할 인원수 N(5<=N<=100,000)이 주어집니다.
 * 두 번째 줄부터 N개의 줄에 각 인원의 도착시간과 떠나는 시간이 주어집니다.
 * 시간은 양의 정수이며, 떠나는 시간은 도착시간보다 항상 큽니다.
 *
 * ▣ 출력설명
 * 피로연 장소에 동시에 존재하는 최대 인원수를 출력합니다.
 *
 * ▣ 입력예제 1
 * 5
 * 14 18
 * 12 15
 * 15 20
 * 20 30
 * 5 14
 *
 * ▣ 출력예제 1
 * 2
 */

function solution(times) {
	// 여기에 풀이를 작성하세요
}

console.log(solution([[14, 18], [12, 15], [15, 20], [20, 30], [5, 14]]));
