/**
 * 03. 최대부분증가수열(LIS)
 *
 * ▣ 문제
 * N개의 자연수로 이루어진 수열이 주어졌을 때, 그 중에서 가장 길게 증가하는(작은 수에서 큰
 * 수로) 원소들의 집합을 찾는 프로그램을 작성하세요.
 * 예를 들어, 원소가 2, 7, 5, 8, 6, 4, 7, 12, 3이면 가장 길게 증가하는 원소들의 집합은
 * {2, 5, 6, 7, 12}이며, 그 길이는 5입니다.
 *
 * ▣ 입력설명
 * 첫째 줄에 수열의 길이 N(1<=N<=1,000)이 주어집니다.
 * 둘째 줄에 N개의 자연수가 공백으로 구분되어 주어집니다.
 *
 * ▣ 출력설명
 * 첫 번째 줄에 가장 긴 증가하는 부분 수열의 길이를 출력합니다.
 *
 * ▣ 입력예제 1
 * 8
 * 5 3 7 8 6 2 9 4
 *
 * ▣ 출력예제 1
 * 4
 */

function solution(arr) {
	// 여기에 풀이를 작성하세요
}

const arr = [5, 3, 7, 8, 6, 2, 9, 4];
console.log(solution(arr));
