/**
 * 05. 최대점수 구하기
 *
 * ▣ 문제
 * 이번 정보올림피아드대회에서 , , N개의 문제를 풀려고 합니다. 각 문제는 그것을 풀었을 때
 * 얻는 점수와 푸는데 걸리는 시간이 주어지게 됩니다. 제한시간 M안에 N개의 문제 중 최대점수
 * 를 얻을 수 있도록 해야 합니다. (해당 문제는 해당 시간이 걸리면 풀 수 있는 것으로 간주한
 * 다, 게 한 유형당 한개만 풀 수 있습니다.)
 *
 * ▣ 입력설명
 * 첫 번째 줄에 문제의 개수 N(1<=N<=20)과 제한 시간 M(10<=M<=300)이 주어집니다.
 * 두 번째 줄부터 N줄에 걸쳐 문제를 풀었을 때의 점수와 푸는데 걸리는 시간이 주어집니다.
 *
 * ▣ 출력설명
 * 첫 번째 줄에 제한 시간안에 얻을 수 있는 최대 점수를 출력합니다.
 *
 * ▣ 입력예제 1
 * 5 20
 * 10 5
 * 25 12
 * 15 8
 * 6 3
 * 7 4
 *
 * ▣ 출력예제 1
 * 41
 */

function solution(m, arr) {
	// 여기에 풀이를 작성하세요
}

const arr = [
	[10, 5],
	[25, 12],
	[15, 8],
	[6, 3],
	[7, 4],
];
console.log(solution(20, arr));
