/**
 * 06. 공주구하기
 *
 * ▣ 문제
 * 정보 왕국의 이웃 나라 , , 공주가 숲속의 , 에 . 정보 왕국의 왕자는
 * 공주를 구하러 갑니다. 정보 왕국의 왕자는 N명의 왕자 중 공주를 구하러 갈 왕자를
 * 정하기 위해 게임을 합니다.
 * 왕자들은 1번부터 N번까지 번호가 매겨져 있으며, 원형으로 둘러 앉습니다.
 * 그리고 1번 왕자부터 시계방향으로 돌아가며 1부터 시작하여 번호를 외치게 됩니다.
 * 한 왕자가 K를 외치면 그 왕자는 원에서 빠지게 되고, 다음 왕자부터 다시 1부터 시작합니다.
 * 이렇게 하여 마지막까지 남은 왕자가 공주를 구하러 갈 수 있습니다.
 * 예를 들어 N=8, K=3이면 원형으로 앉은 순서대로 3번, 6번, 1번, 5번, 2번, 8번, 4번
 * 왕자가 빠지게 되고, 마지막에 남은 7번 왕자가 공주를 구하러 갑니다.
 * N과 K가 주어질 때 공주를 구하러 갈 왕자의 번호를 출력하는 프로그램을 작성하세요.
 *
 * ▣ 입력설명
 * 첫 줄에 자연수 N(5<=N<=1,000)과 K(2<=K<=9)가 주어진다.
 *
 * ▣ 출력설명
 * 첫 줄에 공주를 구하러 갈 왕자의 번호를 출력한다.
 *
 * ▣ 입력예제 1
 * 8 3
 *
 * ▣ 출력예제 1
 * 7
 */

function solution(n, k) {
	// 여기에 풀이를 작성하세요
}

console.log(solution(8, 3)); // 7
