/**
 * 07. 교육과정설계
 *
 * ▣ 문제
 * 현수는 1년 과정의 수업계획을 짜야 합니다.
 * 수업중에는 필수과목이 있습니다. 이 필수과목은 반드시 이수해야 하며, 그 순서도 정해져
 * 있습니다. 만약 필수과목 순서가 CBA로 주어지면 C, B, A 순서대로 이수해야 합니다.
 * 필수과목 순서와 현수가 짠 수업 설계가 주어지면 현수의 수업설계가 올바른지 판단하는
 * 프로그램을 작성하세요.
 * 만약 설계 순서가 CBDAGE라면 필수과목 순서인 CBA가 유지되므로 "YES"를 출력합니다.
 * CADEBG라면 순서가 유지되지 않으므로 "NO"를 출력합니다.
 *
 * ▣ 입력설명
 * 첫 줄에 필수과목의 순서가 주어진다. 과목은 알파벳 대문자로 표현됩니다.
 * 두 번째 줄에 현수가 짠 수업설계가 주어진다. 수업설계는 알파벳 대문자로 표현됩니다.
 *
 * ▣ 출력설명
 * 첫 줄에 "YES" 또는 "NO"를 출력한다.
 *
 * ▣ 입력예제 1
 * CBA
 * CBDAGE
 *
 * ▣ 출력예제 1
 * YES
 */

function solution(need, plan) {
	// 여기에 풀이를 작성하세요
}

console.log(solution('CBA', 'CBDAGE'));
