/**
 * 07. 10부제
 *
 * ▣ 문제
 * 서울시는 6월 1일부터 , 자동차 10부제를 시행한다.
 * 자동차 10부제는 자동차 번호의 일의 자리 숫자와 날짜의 일의 자리 숫자가 일치하면
 * 해당 자동차의 운행을 금지하는 것이다.
 * 날짜의 일의 자리 숫자가 주어지고, 7대의 자동차 번호의 끝 두 자리 수가 주어졌을 때
 * 10부제를 위반한 자동차의 대수를 출력하는 프로그램을 작성하세요.
 *
 * ▣ 입력설명
 * 첫 번째 줄에 날짜의 일의 자리 숫자가 주어진다.
 * 두 번째 줄에 7대의 자동차 번호의 끝 두 자리 수가 주어진다.
 *
 * ▣ 출력설명
 * 첫 번째 줄에 10부제를 위반한 자동차의 대수를 출력한다.
 *
 * ▣ 입력예제 1
 * 3
 * 25 23 11 47 53 17 33
 *
 * ▣ 출력예제 1
 * 3
 */

function solution(day, arr) {
	// 여기에 풀이를 작성하세요
}

console.log(solution(3, [25, 23, 11, 47, 53, 17, 33]));
