/**
 * 08. 일곱난쟁이
 *
 * ▣ 문제
 * 왕비를 피해 일곱 난쟁이들과 함께 평화롭게 생활하고 있던 백설공주에게 위기가 찾아왔다.
 * 일과를 마치고 돌아온 난쟁이가 9명이었던 것이다.
 * 아홉 난쟁이의 키가 주어졌을 때, 백설공주를 도와 일곱 난쟁이를 찾는 프로그램을 작성하세요.
 * (아홉 난쟁이의 키의 합에서 일곱 난쟁이의 키의 합은 100입니다.)
 *
 * ▣ 입력설명
 * 아홉 개의 줄에 걸쳐 난쟁이들의 키가 주어진다. 주어지는 키는 100을 넘지 않는 자연수이며,
 * 아홉 난쟁이의 키는 모두 다르며, 가능한 정답이 여러 가지인 경우에는 아무거나 출력한다.
 *
 * ▣ 출력설명
 * 일곱 난쟁이의 키를 오름차순으로 출력한다.
 *
 * ▣ 입력예제 1
 * 22 7 21 19 10 15 25 8 13
 *
 * ▣ 출력예제 1
 * 7 8 10 13 19 21 25
 */

function solution(arr) {
	// 여기에 풀이를 작성하세요
}

console.log(solution([22, 7, 21, 19, 10, 15, 25, 8, 13]));
